创建型模式：建造者(Builder)模式
一.定义：将一个复杂对象的构造和它的表示分离，使用同样的构造过程可以创建不同的表示，这样的设计模式被称为建造者模式。它将一个复杂的对象分解为多个简单的对象，然后一步一步构建而成。
它将变与不变相分离，即产品的组成部分是不变的，但每一部分是可以灵活选择的
该模式主要有以下优点：
1.各个具体的建造者相互独立，有利于系统的扩展
2.使用者不需要指定产品的内部组成细节，便于控制细节风险
其主要缺点如下：
1.产品的组成部分必须相同，限制了其使用范围
2.如果产品的内部变化复杂，该模式会增加很多的建造者类

二.模式结构
建造者模式的主要角色如下：
1.产品角色(Product):它是包含多个组件部分的复杂对象，由具体建造者来将这些部分组合成对象
2.抽象建造者(Builder):它是一个包含创建产品各个子部件的抽象方法的接口，通常还包含一个返回复杂产品的方法getResult()
3.具体建造者(Concrete Builder):实现Builder接口，完成复杂产品的各个部件的具体创建方法
4.指挥者(Director):它调用建造者对象中的部件与装配方法完成复杂对象的创建，在指挥者中不涉及具体产品的信息(注意它和具体创建者的区别，具体创建者只是一些创建方法，而指挥者是调用这些方法的步骤)

三.建造者模式的应用场景
建造者模式创建的复杂对象，起产品内部的各个部分经常面临着剧烈的变化，但将它们组合在一起的算法却相对稳定，所以它通常在以下场合使用：
1.创建的对象比较复杂，由多个部件构成，各部件面临着复杂的变化，但构建间的建造顺序是稳定的
2.创建复杂对象的算法独立于该对象的组成部分以及它们的装配方式，即产品的构建构成和最终的表示是独立的

四.建造者模式的扩展
1.建造者模式在应用过程中可以根据需要改变，如果创建的产品种类只有一种，只需要一个具体建造者，这时可以省略掉抽象建造者，甚至可以省略掉指挥者角色

五.个人理解：
1.可以这样看待建造者模式，当我们要组装一台电脑时，依据的就是冯·诺伊曼模型，冯·诺伊曼模型规定了一台计算机应该由哪些部分组成，
然后我们依据冯·诺伊曼模型去购买硬件，自己组织成一台电脑，在这个过程中，冯·诺伊曼模型就相当于抽象建造者，我们个人就是具体建造者，而我们组装的过程可以看作指挥者，而电脑就是产品